Autodesk.Revit.DB.Structure.RebarContainerItem.SetFromRebar(Autodesk.Revit.DB.Structure.Rebar)
Set an instance of a RebarContainerItem element according to a Rebar parameters.
rebar:
The Rebar.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The RebarShape of rebar has End Treatments
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016